Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gpio.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the input control of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_InputConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, ControlStatus Cmd)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    GPIOx->INER |= GPIO_PIN;
  else
    GPIOx->INER &= ~GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Select the driving current of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Drive: This parameter can be one of below:
 *        @arg GPIO_DV_4MA  : Selects output driving current as  4 mA
 *        @arg GPIO_DV_8MA  : Selects output driving current as  8 mA
 *        @arg GPIO_DV_12MA : Selects output driving current as 12 mA
 *        @arg GPIO_DV_16MA : Selects output driving current as 16 mA
 * @retval None
 ************************************************************************************************************/
void GPIO_DriveConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, GPIO_DV_Enum Drive)
{
  u8 index = 0, temp =0 ;
  u32 CurrentMode = 0, PinPosition = 0;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_GPIO_DV(Drive));

  GPIO_CK_ON();
  for(index = 0; index < 16; index++ )
  {
    if((GPIO_PIN & 0x0001) == 1)
    {
      temp = index << 1;
      CurrentMode |= ((u32) Drive << temp);
      PinPosition |= ((u32) 0x03  << temp);
    }
    GPIO_PIN >>= 1;
  }
 
  GPIOx->DRVR &= ~PinPosition;
  GPIOx->DRVR |= CurrentMode;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the open drain function of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_OpenDrainConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, ControlStatus Cmd)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    GPIOx->ODR |= GPIO_PIN;
  else
    GPIOx->ODR &= ~GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Get the input data of specified port pin.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: This parameter can be GPIO_PIN_x.
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus GPIO_ReadInBit(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  FlagStatus result;
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));

  GPIO_CK_ON();
  if ((GPIOx->DINR & GPIO_PIN) != RESET)
    result = SET;
  else
    result = RESET;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the input data of specified GPIO port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @return The value of input data register.
 ************************************************************************************************************/
u16 GPIO_ReadInData(HT_GPIO_TypeDef* GPIOx)
{
  u16 uValue;
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  uValue = (u16)GPIOx->DINR;
  GPIO_CK_OFF();
  return (uValue);
}

/*********************************************************************************************************//**
 * @brief Get the output data of specified port pin.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: This parameter can be GPIO_PIN_x.
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus GPIO_ReadOutBit(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  FlagStatus result;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  if ((GPIOx->DOUTR & GPIO_PIN) != RESET)
    result =  SET;
  else
    result = RESET;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the output data of specified GPIO port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @return The value of output data register.
 ************************************************************************************************************/
u16 GPIO_ReadOutData(HT_GPIO_TypeDef* GPIOx)
{
  u32 uValue;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  uValue = (u16)GPIOx->DOUTR;
  GPIO_CK_OFF();
  return uValue;
}

/*********************************************************************************************************//**
 * @brief Set the selected port bits of output data.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: Specify the port bit to be set.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @retval None
 ************************************************************************************************************/
void GPIO_SetOutBits(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  GPIOx->SRR = GPIO_PIN;
  GPIO_CK_OFF();
}

