Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gpio.c
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));
  AFIO_CK_ON();

  for (i = 0; i <= 8; i += 8)
  {
    Mask = 0;
    PinMode = 0;
    if (AFIO_PIN & (0x00FF << i))
    {
      for (index = 0; index < 8; index++)
      {
        if ((AFIO_PIN >> index) & (0x0001 << i))
        {
          Mask |= (0xF << (index * 4));
          PinMode |= (AFIO_MODE << (index * 4));
        }
      }
      *pGPxCFGR = (*pGPxCFGR & (~Mask)) | PinMode;
    }
    pGPxCFGR++;
  }

  AFIO_CK_OFF();
}
#else
/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOA with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPAConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));

  if (AFIO_PIN & 0x00FF)
  {
    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0001)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPACFGR[0] =(HT_AFIO->GPACFGR[0] & ~Mask) | PinMode;
  }

  if (AFIO_PIN & 0xFF00)
  {
    Mask = 0;
    PinMode = 0;

    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0100)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPACFGR[1] =(HT_AFIO->GPACFGR[1] & ~Mask) | PinMode;
  }
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOB with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPBConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));

  if (AFIO_PIN & 0x00FF)
  {
    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0001)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPBCFGR[0] =(HT_AFIO->GPBCFGR[0] & ~Mask) | PinMode;
  }

  if (AFIO_PIN & 0xFF00)
  {
    Mask = 0;
    PinMode = 0;

    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0100)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPBCFGR[1] =(HT_AFIO->GPBCFGR[1] & ~Mask) | PinMode;
  }
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOC with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPCConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

